# Adam:

## Data Loading and Initial Exploration:

### Importing pandas and loading the data:

In [76]:
import pandas as pd
df = pd.read_csv('./jobs_in_data_2024.csv', sep = ',')

### Intial data exploaration :

In [66]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size,job_category
0,2024,Entry-level,Freelance,Applied Data Scientist,30000,USD,30000,United Kingdom,Remote,United Kingdom,M,Data Science and Research
1,2024,Executive,Full-time,Business Intelligence,230000,USD,230000,United States,In-person,United States,M,BI and Visualization
2,2024,Executive,Full-time,Business Intelligence,176900,USD,176900,United States,In-person,United States,M,BI and Visualization
3,2024,Senior,Full-time,Data Architect,171210,USD,171210,Canada,In-person,Canada,M,Data Architecture and Modeling
4,2024,Senior,Full-time,Data Architect,92190,USD,92190,Canada,In-person,Canada,M,Data Architecture and Modeling
...,...,...,...,...,...,...,...,...,...,...,...,...
14194,2021,Senior,Full-time,Data Specialist,165000,USD,165000,United States,Remote,United States,L,Data Management and Strategy
14195,2020,Senior,Full-time,Data Scientist,412000,USD,412000,United States,Remote,United States,L,Data Science and Research
14196,2021,Mid-level,Full-time,Principal Data Scientist,151000,USD,151000,United States,Remote,United States,L,Data Science and Research
14197,2020,Entry-level,Full-time,Data Scientist,105000,USD,105000,United States,Remote,United States,S,Data Science and Research
14198,2020,Entry-level,Contract,Business Data Analyst,100000,USD,100000,United States,Remote,United States,L,Data Analysis

In [2]:
df.describe()

          work_year         salary  salary_in_usd
count  14199.000000   14199.000000    14199.00000
mean    2023.110501  149057.514262   149472.04944
std        0.686929   64932.044143    64379.26016
min     2020.000000   14000.000000    15000.00000
25%     2023.000000  102150.000000   104000.00000
50%     2023.000000  142000.000000   142000.00000
75%     2024.000000  185900.000000   185900.00000
max     2024.000000  450000.000000   450000.00000

In [3]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size,job_category
0,2024,Entry-level,Freelance,Applied Data Scientist,30000,USD,30000,United Kingdom,Remote,United Kingdom,M,Data Science and Research
1,2024,Executive,Full-time,Business Intelligence,230000,USD,230000,United States,In-person,United States,M,BI and Visualization
2,2024,Executive,Full-time,Business Intelligence,176900,USD,176900,United States,In-person,United States,M,BI and Visualization
3,2024,Senior,Full-time,Data Architect,171210,USD,171210,Canada,In-person,Canada,M,Data Architecture and Modeling
4,2024,Senior,Full-time,Data Architect,92190,USD,92190,Canada,In-person,Canada,M,Data Architecture and Modeling

In [61]:
df.sample(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size,job_category
10873,2023,Senior,Full-time,Data Engineer,115000,USD,115000,United States,In-person,United States,M,Data Engineering
8987,2023,Senior,Contract,Consultant Data Engineer,160000,CAD,118539,Canada,Remote,Canada,L,Data Engineering
5469,2023,Mid-level,Full-time,Data Specialist,90000,USD,90000,United States,In-person,United States,M,Data Management and Strategy
6917,2023,Senior,Full-time,Data Scientist,139000,USD,139000,United States,In-person,United States,M,Data Science and Research
4830,2023,Senior,Full-time,Data Scientist,197500,USD,197500,United States,In-person,United States,M,Data Science and Research

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14199 entries, 0 to 14198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14199 non-null  int64
 1   experience_level    14199 non-null  object
 2   employment_type     14199 non-null  object
 3   job_title           14199 non-null  object
 4   salary              14199 non-null  int64
 5   salary_currency     14199 non-null  object
 6   salary_in_usd       14199 non-null  int64
 7   employee_residence  14199 non-null  object
 8   work_setting        14199 non-null  object
 9   company_location    14199 non-null  object
 10  company_size        14199 non-null  object
 11  job_category        14199 non-null  object
dtypes: int64(3), object(9)
memory usage: 1.3+ MB

## Data Cleaning:

### Checking for null values:

In [65]:
nan_count = df.isnull().sum().sum()
print('Number of NaN values:', nan_count)

Number of NaN values: 0

### Checking for duplicates:

In [71]:
duplicate_rows = df.duplicated().sum()

print(duplicate_rows)

5493

### Checking which categorical coloumns need to be addressed:

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14199 entries, 0 to 14198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14199 non-null  int64
 1   experience_level    14199 non-null  object
 2   employment_type     14199 non-null  object
 3   job_title           14199 non-null  object
 4   salary              14199 non-null  int64
 5   salary_currency     14199 non-null  object
 6   salary_in_usd       14199 non-null  int64
 7   employee_residence  14199 non-null  object
 8   work_setting        14199 non-null  object
 9   company_location    14199 non-null  object
 10  company_size        14199 non-null  object
 11  job_category        14199 non-null  object
dtypes: int64(3), object(9)
memory usage: 1.3+ MB

### Dealing with duplicates:

### Dealing with categorical coloumns:

# Moudi: